Repository: serq26/ing-case-study
Catalog: xliff/*.xlf
Languages: tr

# s3db6c3999daeecdb
source: Employee List
tr: Çalışan Listesi

# scba00271d50c74f6
source: Employees
tr: Çalışanlar

# s4ec58dc6a75753da
source: Add New
tr: Yeni Ekle

# s4caed5b7a7e5d89b
source: English
tr: İngilizce

# s9d2d00982edafabb
source: Turkish
tr: Türkçe

# s2c57913ffd36d298
source: First Name
tr: İsim

# s95a75a2392af5780
source: Last Name
tr: Soyisim

# s53802e3f37d072a7
source: Date of Birth
tr: Doğum Tarihi

# s772528836550622c
source: Date of Employment
tr: İşe Başlama Tarihi

# sf1bc83d2509bafcf
source: Phone
tr: Telefon

# sd1f44f1a8bc20e67
source: Email
tr: E-posta

# s1e45a4d7635fbda7
source: Department
tr: Bölüm

# sc1611c0558728a2a
source: Position
tr: Pozisyon

# s8af61807443f32a4
source: Actions
tr: İşlemler

# s94ec139e88fa8580
source: ${fieldName} is required
tr: ${fieldName} zorunlu alandır

# s33f85f24c0f5f008
source: Save
tr: Kaydet

# s2ceb11be2290bb1b
source: Cancel
tr: Vazgeç

# s0bf5d587a07fcaea
source: Add New Employee
tr: Yeni Çalışan Ekle

# h79c40a44a9920372
source: Edit Employee: <span style="color:black">${fullName}</span>
tr: Çalışan Güncelleme: <span style="color:black">${fullName}</span>

# s268ecd1cef45a9a8
source: Are you sure?
tr: Emin misin?

# s2714784162ec459d
source: Proceed
tr: İlerle

# sffa721bb6aa3128d
source: Search...
tr: Ara...

# sdb06f504800b7167
source: ${this.selectedEmployees.length} records will be deleted
tr: ${this.selectedEmployees.length} kayıt silinecek

# h3b19e2a2831925e3
source: Selected employee record of <strong>"${this.selectedEmployee?.firstName} ${this.selectedEmployee?.lastName}"</strong> will be deleted
tr: <strong>"${this.selectedEmployee?.firstName} ${this.selectedEmployee?.lastName}"</strong> silinecek

# sc27877746b461373
source: ${this.selectedEmployees.length} rows selected
tr: ${this.selectedEmployees.length} satır seçildi

# sdc673e73b5c13aea
source: Delete
tr: Sil

# s8a7bee24f1eeaff1
source: Sort
tr: Sırala

# sbbea6b8ad961f527
source: Total Records
tr: Toplam Kayıt

# s7dc552fda8bc803d
source: ${this.viewType === 'table' ? 'Rows' : 'Cards'} per page
tr: Sayfa başına ${this.viewType === 'table' ? 'Satır' : 'Kart'}

# sf71f9578ca2ddb9a
source: Department is required
tr: Bölüm zorunlu alan

# s35911e54e5c305df
source: Position is required
tr: Pozisyon zorunlu alan

# sa04e5c14a9134fc4
source: Please enter another email address. Another user is registered with this email address.
tr: Lütfen başka bir e-posta adresi girin. Başka bir kullanıcı bu e-posta adresiyle kayıtlı.

# s4334525318da4056
source: Please enter another phone number. Another user is registered with this phone number.
tr: Lütfen başka bir telefon numarası girin. Başka bir kullanıcı bu telefon numarasıyla kayıtlı.

# s91c63c6231457c16
source: Employee updated successfully!
tr: Çalışan başarıyla güncellendi!

# se7b8908ee5caa708
source: Failed to update employee.
tr: Çalışan güncellenemedi.

# s055557a4050ab26f
source: Employee added successfully!
tr: Çalışan başarıyla eklendi!

# s2b3c83144d75fd7c
source: Failed to add employee.
tr: Çalışan eklenemedi.

# sbf38b62ad692ac35
source: Invalid phone number
tr: Geçersiz telefon numarası

# sfa22ac1436f238cd
source: Turn Back
tr: Geri Dön

# s86ffdcafef2b979d
source: Employee record of "${emp.firstName} ${emp.lastName}" will be updated
tr: Çalışan "${emp.firstName} ${emp.lastName}" güncellenecek

# ha656fe384f9c475e
source: <p>Record not found.</p>
tr: <p>Kayıt bulunamadı.</p>

# s108118119b43064b
source: ${fieldName} must be between 2 and 50 characters
tr: ${fieldName} 2 ile 50 karakter arasında olmalıdır

# s403810446efeea25
source: Only alphabetic characters, space, ' and - are allowed
tr: Sadece alfabetik karakterlere, boşluğa, ' ve - izin verilir

# s227958cdd1d2f84d
source: Date of Employment is required
tr: İşe Başlama Tarihi zorunlu alan

# se0baa9b7fb0768e4
source: Invalid date
tr: Geçersiz tarih

# s2021e6a92b59b1de
source: Date of Employment must be after 1900
tr: İşe Başlama tarihi 1900'den sonra olmalıdır

# sbee512f1b03d3cff
source: Date of Employment cannot be in the future
tr: İşe Başlama tarihi gelecekte olamaz

# scf226d2c20f172c2
source: Phone is required
tr: Telefon zorunlu alan

# s76f3ff0ef9b3009a
source: Date of Birth is required
tr: Doğum Tarihi zorunlu alan

# sdf7043eb187bf3b3
source: Date of Birth must be after 1900
tr: Doğum tarihi 1900'den sonra olmalıdır

# sedfd550b74345138
source: Date of Birth cannot be in the future
tr: Doğum tarihi gelecekte olamaz

# s6048203e003909d7
source: Must be at least 18 years old
tr: En az 18 yaşında olmalı

# sf07904be22a6165a
source: Email is required
tr: E-posta zorunlu alan

# s6faf53a851ae1ef8
source: Invalid email address
tr: Geçersiz e-posta adresi

# s89d55fcfb0a9b23d
source: ${this.selectedEmployees.length} records deleted!
tr: ${this.selectedEmployees.length} kayıt silindi!

# s81b9c8c8d07d84e1
source: ${employee.firstName} ${employee.lastName} deleted!
tr: ${employee.firstName} ${employee.lastName} silindi!

# s3ced410ef8850869
source: Select Department
tr: Bölüm Seçiniz

# sd3b242173c2c4284
source: Select Position
tr: Pozisyon Seçiniz

# s2888976f54dcceb7
source: Page Not Found
tr: Sayfa Bulunamadı

# s30c26ef5c375aab1
source: All rights reserved.
tr: Tüm hakları saklıdır.
